tutorials/shockTube_rhoThermo/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default                  Gauss vanLeer;

    //div(phi,U)               Gauss vanLeer 0.2;
    //div(phi,h)               Gauss vanLeer;
    //div(phi,Yi)              Gauss vanLeer;
    //div(phi,Yi_h)            Gauss vanLeer;
    div(phi,K)               Gauss linear;

    div((rho*nuEff*dev2(T(grad(U))))) linear; // viscous term
}

laplacianSchemes
{
    //default         Gauss linear orthogonal;
    default           Gauss vanLeer phi orthogonal;
}

interpolationSchemes
{
    default         vanLeer phi 1.0;
    //default         limitedLinear phi 1.0;
    //default          linear;

    reconstruct(rho)         vanLeer;
    reconstruct(U)           vanLeerV;
    reconstruct(T)           vanLeer;

    //flux(rhoU)               linear;
    //div((rho*nuEff*dev2(T(grad(U))))) linear;  // for divSchemes
    //flux((-(rho*nuEff)*dev2(T(grad(U))))) linear; // <--- v12 requirement
}

snGradSchemes
{
    default         orthogonal;
}


// ************************************************************************* //
